#ifndef TEXT_H
#define TEXT_H
std::string txt1 = " МЕНЮ\n нажмите 1 (затем ENTER) чтобы начать играть. нажмите 2 (затем ENTER) чтобы продолжить игру\n\n\n";
std::string txt2 = " 0 выйти из меню крафта (если кроме этого текста здесь ничего не написано, значит вы не можете ничего создать. если кроме этого текста здесь чтото написано, значит вы можете это создать)\n";
std::string txt3 = " 1 создать прибор для просмотра значения шапки за 0.600 кг железа (заряд 1)\n";
std::string txt4 = " 2 создать прибор для просмотра значения шарфа за 0.600 кг железа и 0.150 кг дерева (заряд на 1 использование)\n";
std::string txt5 = " 3 создать инвертор значений шапки и шарфа за 1.3 кг железа (заряд 1) (при исподьзовании 1 меняет на -1, -1 меняет на 1, 0 меняет на 0, использование работает одновременно на шапку и шарф)\n";
std::string txt6 = " 4 востановить 1 здоровье за 0.31 кг дерева\n";
std::string txt7 = " 5 зарядить любой предмет которому нужен заряд на 2 за 0.300 кг никеля\n";
std::string txt8 = " 6 востановить орган за 0.600 кг никеля\n";
std::string txt9 = " 7 увеличить иммунитет на 15 за 0.100 кг никеля и 0.200 кг железа\n";
std::string txt10 = " 8 уменьшить инфекцию на 15 за 0.080 кг никеля и 0.150 кг железа\n";
std::string txt11 = " 9 создать деревянного механического кота за 2.500 кг дерева (заряд 10)\n";
std::string txt12 = " 10 создать прибор для изменения значений металла за 2.0 дерева (заряд 1)\n";
std::string txt13 = " 11 создать прибор для изменения значений электростанций за 2.0 дерева (заряд 1)\n";
std::string txt14 = " 12 создать прибор для просмотра значений металла за 0.8 дерева (заряд 1)\n";
std::string txt15 = " 13 создать прибор для просмотра значений электростанций за 0.8 дерева (заряд 1)\n";
std::string txt16 = " 14 создать прибор для просмотра значений чая за 1.0 дерева (заряд 1)\n";
std::string txt17 = " выберите";
std::string txt18 = " предмет чей заряд увеличить на 1 (1 прибор для просмотра значений шапок. 2 прибор для просмотра значений шарфов. 3 инвертор. 4 деревянный механический кот. 5 прибор для изменения значений металлов. 6 прибор для изменения значений электростанций. 7 прибор для просмотра значений металлов. 8 прибор для просмотра значений электростанций. 9 прибор для просмотра значений чая)\n";
std::string txt19 = " ещё раз";
std::string txt20 = "\n . . . . . ошибка . . . . .\n\n";
std::string txt21 = " перемещение на WASD. 0 выход\n";
std::string txt22 = "\n . . . . . . . . . . началась новая игра! . . . . . . . . . .\n\n";
std::string txt23 = " . . . . . вас укусил монстр . . . . .\n";
std::string txt24 = "Зелёная";
std::string txt25 = "Красная";
std::string txt26 = "";
std::string txt27 = "";
std::string txt28 = "";
std::string txt9201 = " введите 2 числа через пробел, первое число отвечает за количество шарфов и шапок (введёте 10 будет 10 шапок и 10 шарфов) второе число отвечает за количество чаёв\n";
std::string txt9202 = " готово, количество шапок и шарфов: ";
std::string txt9203 = " количество чаёв: ";
std::string null = " null ";







#endif